# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [57]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [58]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [59]:
#  1. Get the total rides for each city type
total_rides = pyber_data_df.groupby(["type"]).count()["ride_id"]
total_rides

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [60]:
# 2. Get the total drivers for each city type
total_drivers = city_data_df.groupby(["type"]).sum()["driver_count"]
total_drivers

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [61]:
#  3. Get the total amount of fares for each city type
total_fares = pyber_data_df.groupby(["type"]).sum()["fare"]
total_fares

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [62]:
#  4. Get the average fare per ride for each city type. 
# Calculate the percentage of fare for each city type.

fare_per_ride = total_fares / total_rides 
fare_per_ride

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [63]:
# 5. Get the average fare per driver for each city type. 
fare_per_driver = total_fares / total_drivers
fare_per_driver

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [64]:
#  6. Create a PyBer summary DataFrame. 
summary_df = pd.DataFrame({"Total_rides":total_rides, "Total_drivers": total_drivers, "Total_fares" : total_fares, "Average_Fare_per_Ride": fare_per_ride, "Average_Fare_per_Driver": fare_per_driver})
summary_df

,Total_rides,Total_drivers,Total_fares,Average_Fare_per_Ride,Average_Fare_per_Driver
type,,,,,
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [65]:
#  7. Cleaning up the DataFrame. Delete the index name
summary_df.index.name = None
summary_df

,Total_rides,Total_drivers,Total_fares,Average_Fare_per_Ride,Average_Fare_per_Driver
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [66]:
#  8. Format the columns.

summary_df["Total_rides"] = summary_df["Total_rides"].map("{:,}".format)

summary_df["Total_drivers"] = summary_df["Total_drivers"].map("{:,}".format)

summary_df["Total_fares"] = summary_df["Total_fares"].map("${:,.2f}".format)

summary_df["Average_Fare_per_Ride"] = summary_df["Average_Fare_per_Ride"].map("${:,.2f}".format)

summary_df["Average_Fare_per_Driver"] = summary_df["Average_Fare_per_Driver"].map("${:,.2f}".format)

summary_df

,Total_rides,Total_drivers,Total_fares,Average_Fare_per_Ride,Average_Fare_per_Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [77]:
# 1. Read the merged DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [75]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
sum_per_date_df = pyber_data_df.groupby(["date","type"]).sum()["fare"]
sum_per_date_df

date                 type
2019-01-01 00:08:16  Urban       37.91
2019-01-01 00:46:46  Suburban    47.74
2019-01-01 02:07:24  Suburban    24.07
2019-01-01 03:46:50  Urban        7.57
2019-01-01 05:23:21  Urban       10.75
                                 ...
2019-05-08 04:20:00  Urban       21.99
2019-05-08 04:39:49  Urban       18.45
2019-05-08 07:29:01  Urban       18.55
2019-05-08 11:38:35  Urban       19.77
2019-05-08 13:10:18  Urban       18.04
Name: fare, Length: 2375, dtype: float64

In [74]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.

sum_per_date_df = sum_per_date_df.reset_index()
sum_per_date_df.head()

type                 date  Rural  Suburban  Urban
0     2019-01-01 00:08:16    NaN       NaN  37.91
1     2019-01-01 00:46:46    NaN     47.74    NaN
2     2019-01-01 02:07:24    NaN     24.07    NaN
3     2019-01-01 03:46:50    NaN       NaN   7.57
4     2019-01-01 05:23:21    NaN       NaN  10.75

In [70]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 
sum_per_date_df = sum_per_date_df.pivot(index= "date", columns = "type", values="fare")
sum_per_date_df.head(10)

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
2019-01-01 09:45:36  43.69       NaN    NaN
2019-01-01 12:32:48    NaN     25.56    NaN
2019-01-01 14:40:14    NaN       NaN   5.42
2019-01-01 14:42:25    NaN       NaN  12.31
2019-01-01 14:52:06    NaN     31.15    NaN

In [78]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.
loc_sum_pivottable = sum_per_date_df.loc['2019-01-01':'2019-04-29']
loc_sum_pivottable.head(10)

date                 type
2019-01-01 00:08:16  Urban       37.91
2019-01-01 00:46:46  Suburban    47.74
2019-01-01 02:07:24  Suburban    24.07
2019-01-01 03:46:50  Urban        7.57
2019-01-01 05:23:21  Urban       10.75
2019-01-01 09:45:36  Rural       43.69
2019-01-01 12:32:48  Suburban    25.56
2019-01-01 14:40:14  Urban        5.42
2019-01-01 14:42:25  Urban       12.31
2019-01-01 14:52:06  Suburban    31.15
Name: fare, dtype: float64

In [81]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)
loc_sum_pivottable.index = pd.to_datetime(sum_per_date_df.index)
loc_sum_pivottable

TypeError: <class 'tuple'> is not convertible to datetime

In [17]:
# 7. Check that the datatype for the index is datetime using df.info()

In [18]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [19]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')